# constants.py

# Размеры поля
BOARD_SIZE = 9

# Параметры отображения
CELL_SIZE = 50
LEFT_MARGIN = 20
TOP_MARGIN = 20

# Цвета
BACKGROUND_COLOR = (0, 0, 0)
LINE_COLOR = (255, 255, 255)
BALL_COLORS = [
    (255, 0, 0),    # Красный
    (0, 255, 0),    # Зеленый
    (0, 0, 255),    # Синий
    (255, 255, 0),  # Желтый
    (0, 255, 255),  # Голубой
    (255, 0, 255),  # Фиолетовый
    (128, 0, 0),    # Темно-красный
    (0, 128, 0),    # Темно-зеленый
    (0, 0, 128)     # Темно-синий
]

# Количество шариков для линии
LINE_LENGTH = 5

# Количество новых шариков за ход
NEW_BALLS = 3

# Очки за удаление шаров
SCORES = {5: 10, 6: 12, 7: 18, 8: 28, 9: 42}

